# Տրվում է բնական թվերի ցանկ։ Պահանջվում է դրանցից կազմվել set։
# Եթե որևէ թիվ կրկնվում է, ապա այն փոխարկեք տողի՝ ըստ օրինաչափության.
# օրինակ, եթե 4 թիվը կրկնվում է 3 անգամ, ապա բազմությունը կպարունակի հետևյալ գրառումը՝
# ինքը int 4 թիվը, «44» string ( երկրորդ կրկնություն, այսինքն՝ թիվը կրկնօրինակվում է տողում),
# string «444» (երրորդ կրկնությունը, այսինքն՝ տողը բազմապատկվում է 3-ով):
# Իրականացնել բազմությունների գեներացումը set_gen () ֆունկցիայի միջոցով:

my_list = [5, 6, 9, 8, 7, 4, 1, 1, 2, 5, 5, 2, 3, 6, 2, 5]


def set_gen(ls: list):
    my_set = set()
    for i in range(len(ls)):
        count_i = 0
        for j in range(len(ls)):
            if ls[i] == ls[j]:
                count_i += 1
        if count_i == 1:
            my_set.add(ls[i])
        else:
            my_set.add((str(ls[i]))*count_i)
        # print(f'{ls[i]},  {count_i}')
    print(my_set)


set_gen(my_list)
